//=================================================================================================
// YMZ294ライブラリ
//=================================================================================================
#ifndef	__YMZ294_H__
#define __YMZ294_H__ 

#include <avr/io.h>
#include <stdbool.h>

#ifndef BYTE
	#define	BYTE		unsigned char
#endif	// #ifndef BYTE

#ifndef WORD
	#define WORD		uint16_t
#endif	// #ifndef WORD


//---< YMZ294 制御PIN設定 >--------------------------------
#define RESET_PIN		_BV( PIND6 )
#define AD_PIN			_BV( PIND5 )
#define CS_PIN			_BV( PIND4 )
#define WR_PIN			_BV( PIND3 )
#define D0_PIN			_BV( PINB0 )
#define D1_PIN			_BV( PINB1 )
#define D2_PIN			_BV( PINB2 )
#define D3_PIN			_BV( PINB3 )
#define D4_PIN			_BV( PINB4 )
#define D5_PIN			_BV( PINB5 )
#define D6_PIN			_BV( PINB6 )
#define D7_PIN			_BV( PINB7 )
//---------------------------------------------------------

// チャンネル種別
typedef enum
{
	YMZ294_CH_A = 0,	// Channel_A
	YMZ294_CH_B,		// Channel_B
	YMZ294_CH_C			// Channel_C
} YMZ294_CH_ENUM;






//-------------------------------------------------------------------
// YMZ294初期化
//-------------------------------------------------------------------
void YMZ294_Init( void );

//-------------------------------------------------------------------
// YMZ294リセット処理
//-------------------------------------------------------------------
void YMZ294_Reset( void );

//-------------------------------------------------------------------
// YMZ294楽音周波数設定($00 - $05)
//-------------------------------------------------------------------
void YMZ294_SetFreq( YMZ294_CH_ENUM eCh, WORD wFreq );

//-------------------------------------------------------------------
// YMZ294ノイズ周波数設定($06)
//-------------------------------------------------------------------
void YMZ294_SetNoiseFreq( BYTE Freq );

//-------------------------------------------------------------------
// YMZ294ミキサー設定($07)
//-------------------------------------------------------------------
void YMZ294_SetMixer( BYTE Noise, BYTE Tone );

//-------------------------------------------------------------------
// YMZ294音量設定($08 - $0A)
//-------------------------------------------------------------------
void YMZ294_SetVolume( YMZ294_CH_ENUM eCh, bool bEnv, BYTE Level );

//-------------------------------------------------------------------
// YMZ294エンベローブ周波数設定($0B - $0C)
//-------------------------------------------------------------------
void SetEnvFreq( WORD wFreq );

//-------------------------------------------------------------------
// YMZ294エンベローブ形状の設定($0D)
//-------------------------------------------------------------------
void YMZ294_SetEnvShape( BYTE Cont, BYTE Att, BYTE Alt, BYTE Hold );

#endif	// #ifndef	__YMZ294_H__