/*
 * YMZ294_Test.c
 *
 * Created: 2012/07/10 20:56:03
 *  Author: MIBC
 */ 

#include <avr/io.h>
#include <util/delay.h>
#include "YMZ294.h"


const WORD SCALE[ 72 ] = 
{//    ド,   ド#,    レ,   レ#,    ミ,  ファ, ファ#,    ソ,   ソ#,    ラ,    シ,   シ#
	  262,   277,   293,   311,   330,   349,   370,   392,   415,   440,   466,   494,		//  0 - 11 
	  524,   554,   586,   622,   660,   698,   740,   784,   830,   880,   932,   988,		// 12 - 23
	 1048,  1108,  1172,  1244,  1320,  1396,  1480,  1568,  1660,  1760,  1864,  1976,		// 24 - 35
	 2096,  2216,  2344,  2488,  2640,  2792,  2960,  3136,  3320,  3520,  3728,  3952,		// 36 - 47
	 4192,  4432,  4688,  4976,  5280,  5584,  5920,  6272,  6640,  7040,  7456,  7904,		// 48 - 59
	 8384,  8864,  9376,  9952, 10560, 11168, 11840, 12544, 13280, 14080, 14912, 15808,		// 60 - 71
};	


int main(void)
{
	BYTE		i = 0;

	// YMZ294初期化
	YMZ294_Init();
	
	//YMZ294_SetEnvShape( 1,0,1,0);
	
	// 音量設定
	YMZ294_SetVolume( YMZ294_CH_A, false, 15 );	
	YMZ294_SetVolume( YMZ294_CH_B, false, 15 );	
	YMZ294_SetVolume( YMZ294_CH_C, false, 15 );	
	
	// ミキサー設定
	YMZ294_SetMixer( 0x07, 0x00 ); 
	

	
	
    while(1)
    {
		for ( i = 1 ; i < 60 ; i++ )
		{
			// 周波数設定
			YMZ294_SetFreq( YMZ294_CH_A, (4000000UL/16UL/SCALE[i]) );
			YMZ294_SetFreq( YMZ294_CH_B, (4000000UL/16UL/SCALE[i+3]) );
			YMZ294_SetFreq( YMZ294_CH_C, (4000000UL/16UL/SCALE[i+6]) );
			_delay_ms(50);	
		}     
    }
	
	return 0;
}