//=================================================================================================
// SCCB ライブラリ
//=================================================================================================
#include <avr/io.h>
#include <stdbool.h>
#include "I2C_Lib.h"


//-------------------------------------------------------------------------------------------------
// SCCB 初期化
//-------------------------------------------------------------------------------------------------
void SCCB_Init(void)
{
	I2C_Init();
}


//-------------------------------------------------------------------------------------------------
// SCCB 書込み
//-------------------------------------------------------------------------------------------------
bool SCCB_Write( unsigned char ID, unsigned char Addr, unsigned char Data )
{
	bool				bRet = false;
	unsigned char		TempData[ 2 ] = { 0x00, 0x00 };
		
	
	TempData[ 0 ] = Addr;
	TempData[ 1 ] = Data;
	bRet = I2C_Master_Write( ID, &TempData[0], 2 );
	
	return bRet;
}


//-------------------------------------------------------------------------------------------------
// SCCB 読込み
//-------------------------------------------------------------------------------------------------
bool SCCB_Read( unsigned char ID, unsigned char Addr, unsigned char *pData )
{
	bool				bRet = false;


	// 読込みアドレスを指定
	bRet = I2C_Master_Write( ID, &Addr, 1 );
	if ( bRet == true )
	{
		// 読込み
		bRet = I2C_Master_Read( ID, pData );
	}
	
	return bRet;
}




