/*
 * XBeeLib.h
 *
 * Created: 2012/08/19 0:18:32
 *  Author: MIBC
 */ 


#ifndef XBEELIB_H_
#define XBEELIB_H_

#include <avr/io.h>
#include <stdbool.h>


#define SWITCH_PIN		_BV(PINB0)
#define XBEE_DOUT		_BV(PINB1)
#define XBEE_RESET		_BV(PINB2)
#define XBEE_ATTN		_BV(PINB3)
#define SPI_SS			_BV(PINB4)
#define SPI_MOSI		_BV(PINB5)
#define SPI_MISO		_BV(PINB6)
#define SPI_SCK			_BV(PINB7)


//=================================================================================================
// 構造体定義
//=================================================================================================
// XBEE APIフレーム構造体
typedef struct  
{
	unsigned char		StartDelimiter;
	uint16_t			wLength;
	char				*pszData;
	unsigned char		CheckSum;
} XBEE_API_FRAME_TABLE, *PXBEE_API_FRAME_TABLE;



//=================================================================================================
// 関数定義
//=================================================================================================
//-------------------------------------------------------------------------------------------------
// XBee初期化
//-------------------------------------------------------------------------------------------------
bool XBee_Init(void);


//-------------------------------------------------------------------------------------------------
// XBeeリセット
//-------------------------------------------------------------------------------------------------
bool XBee_Reset(void);


//-------------------------------------------------------------------------------------------------
// XBee受信データ取得
//-------------------------------------------------------------------------------------------------
bool XBee_GetRecvData( char *pData, uint16_t *pwSize );


//-------------------------------------------------------------------------------------------------
// XBee 受信データ解析
// ※XBee 受信データ解析の戻り値がtrueの場合、解析データが不要になったらPXBEE_API_FRAME_TABLEの
//   pDataをfree関数を使用して領域を解放してください
// 戻り値： 0 = 正常
//         -1 = API Frameデータでない
//         -2 = サイズチェックエラー
//         -3 = メモリ生成エラー
//         -4 = チェックサムエラー 
//-------------------------------------------------------------------------------------------------
int XBee_AnalyzeRecvData( char *pData, uint16_t wDataSize, PXBEE_API_FRAME_TABLE ptXBeeApiFrame );


//-------------------------------------------------------------------------------------------------
// XBee チェックサム生成
//-------------------------------------------------------------------------------------------------
unsigned char XBee_CreateCheckSum( char *pData, uint16_t wDataSize );


//-------------------------------------------------------------------------------------------------
// XBee Api Frame送信
// ※XBee 受信データ解析の戻り値がtrueの場合、解析データが不要になったらPXBEE_API_FRAME_TABLEの
//   pDataをfree関数を使用して領域を解放してください
//-------------------------------------------------------------------------------------------------
bool XBee_SendApiFrame( const PXBEE_API_FRAME_TABLE ptXBeeApiFrame, PXBEE_API_FRAME_TABLE ptXBeeResApiFrame );

//-------------------------------------------------------------------------------------------------
// XBee Wi-Fi接続待ち
//-------------------------------------------------------------------------------------------------
bool XBee_JoinedWifi( void );

#endif /* XBEELIB_H_ */